[
  "In this era of the VC-funded horse-race that is the Tech Industry in 2020, I've been reflecting on one quiet but radical protestor: WordPress.",

  "When WordPress began in 2003, The Internet was still largely uncolonized and inhabited by nerds. The WordPress mission: <strong>to create a totally free, open, and accessible publishing platform for The Internet,</strong> seemed like esoteric gibberish to anybody who wasn't actively publishing or reading content. This population was tiny when compared to the world we live in post smart-phone, in which all social interaction are filtered through the portal of the internet. COVID has pushed this even further, to the point where basically only the maintenance of our physical bodies hasn't yet been abstracted to an online software layer. I pray that this last citadel of sweat and poop and hair remains ours forever, amen.",

  "As usual, we're lucky the nerds had a head-start before business moved in. In today's economic climate, the WP mission would be considered quixotic or maybe even terrorism. This is tragic because it is this very potential to share new discoveries at no cost that inspired visionaries like Doug Englebart and Alan Kay to create this thing in the first place. The Internet was to be a place where scientists, and then eventually all creators of knowledge and culture, could collaborate and archive their work to the decentralized benefit of anyone who could log on.",

  "Let’s contrast this with what actually happens today: a young business student, who wants a lot of money really fast, develops some basic feature in a modern framework, e.g. a service that sends JSON objects to an API endpoint (cough, contentful, cough). There is absolutely nothing innovative, original, or even difficult about this product. It “solves” a problem that has been solved for free for 17 years (via WordPress) and charges $800 a month to do it. The design behind the system itself is so basic, it would be a nice example to teach intro students on how data calls work on the web.",

  "But behold: a band of wild investors, drunk with bloodthirst for their next unicorn, slaps a SaaS padlock on it and begins an amphetaminic hype ritual with bright colors and cute cartoon characters and a whole quasi-magical language of metaphor and imagery to obfuscate the fact that they’re basically just reselling a spreadsheet, or a database, or some basic scripts to pipe data from Vendor A to Vendor B. These technologies were invented in the 80s, but only recently have the cokeheads over on Wall Street figured out that you can box these things up with bright branding and cute animal characters, deploy them to AWS, and charge VC-funded companies $1000/month. These people then expect to collect huge amount of <em>passive</em> income for having the “vision” or “insight” to horde and plagiarize the basic inventions of others. The run their very clean mouths about “innovation” and “open communication” as they pay Google and Facebook millions of $$$/year to feed us absolute garbage: targeted mind-control imagery to make you feel lacking, pull out your credit card, and pick their magic show over all the other identical magic shows.",

  "Millions of dollars later, about 1000 people are all hard at work on a product that has no reason to exist, except to extract illusory wealth out of other VC funded horses (the Software Engineer goes neigh). We sit through webinars where very clean people talk like evangelicals about this beautiful animal they are keeping chained in a cage for their petty profit.",

  "Zuckerberg set the precedent for this, and it’s now the philosophy of Silicon Valley. People expect six-figure salaries for being able to parrot this morning’s hot blog article. They put on <em>very nice</em> outfits and just kind of wait for money to appear because they “have ideas” or are “disrupting the market.” There is no value placed on experience, hard work, or making something for the greater good. Every single motivation points toward moving the needle, maxing out ROI, and cutting the throats of anyone who even looks at your giant pile of money. Meanwhile, these people will talk to you with a straight face about radical honesty, gratitude, and wellness, while behind their very white eyes they’re actually calculating how much this last round of funding is going to affect their share of the IPO. People Ops will provide a thoroughly vetted script insulating the company from all legal liability and leaving you with the warm, fuzzy illusion of care. ",

  "Lately I’ve been yelling to myself about this in my bathroom at home until I want to puke.",

  "This is not constructive, so instead I’m going back to open source and offering my help to anyone doing the same.",

  "If you need a job and don’t know how to find one in this Brave Virtual World, WordPress can help:",

  "=> About a third of The Internet runs on WordPress. This means even just knowing how to use the back-end /wp-admin/ interface to update images, configure posts, export data, etc. could make you useful to a lot of companies. If you want to dig further and actually write code, WP offers a lovely balance of FE/BE work, through CSS/Themes in the front and PHP/MYSQL/Plugins in the back. It all fits together and if I had to design an intro curriculum to teach people web dev, it would basically be two words: Learn WordPress. The cost of admission is zero dollars and there are tutorials, videos and forums galore, along with an established, diverse, multi-lingual, worldwide community with (currently virtual) meetups, forums, etc. It is so easy to get help with WP. ",

  "If you are a business or activist group or organizer looking to begin or reboot your digital presence, WordPress is the best option because it’s been used and tested by millions for the last 17 years and costs $0/month. There’s about 10 years of Stack Overflow questions addressing every weird bug you hit, and a lot of free plugins offering features you'd normally have to hire a dev for. Thanks to the recent Gutenberg updates, along with the REST API, and the awesome work by the contributors on https://github.com/jaredpalmer/presspack we can now use modern build tools like node package management, Webpack, PostCSS, etc. to make WP as powerful an option as any other platform on the web today.",

  "This is really important and we need to start right now. We need to start doing our own work, hosting our own content, and taking back our money from boards and funds in rooms far, far away from us. ",

  "Please email me ASAP at tylerhillwebdev@gmail.com",

  "Thank you for your time.",

  "I believe with a manic passion that liberating The Internet and reclaiming it as a tool for democratizing the future of commerce and culture is one of the keystones in saving Our Country and Our World from this death spiral. "
]
